Repository: RyuhungLiu/LineResistanceHost_WinUI
Catalog: LineResistanceHost/Strings/*/Resources.resw
Source language: en_us
Languages: zh_hans, zh_hant

# AppTitleDisconnected
source: Disconnected
zh_hans: 未连接
zh_hant: 未連接

# AppTitleOa1Connected
source: ATK-OA1 Connected
zh_hans: ATK-OA1已连接
zh_hant: ATK-OA1已連接

# AppTitleK2Connected
source: WITRN K2 Connected
zh_hans: WITRN K2已连接
zh_hant: WITRN K2已連接

# BusResistance
source: Bus R
zh_hans: 总线阻
zh_hant: 總線阻

source: Cable length
zh_hans: 线材长度
zh_hant: 線材長度

# CableSection
source: Cable
zh_hans: 线材
zh_hant: 線材

# CableType
source: Type
zh_hans: 类型
zh_hant: 類型

source: Pin continuity
zh_hans: 引脚通断
zh_hant: 引腳通斷

source: Raw frame
zh_hans: 原始帧
zh_hant: 原始幀

# DeviceCapture
source: Device and capture
zh_hans: 设备与采集
zh_hant: 設備與擷取

source: Target HID device
zh_hans: 目标 HID 设备
zh_hant: 目標 HID 設備

source: No device found
zh_hans: 未发现设备
zh_hant: 未發現設備

source: Preempt
zh_hans: 抢占
zh_hant: 搶占

# FrameCount
source: Frames
zh_hans: 帧数
zh_hant: 幀數

source: Checksum
zh_hans: 校验
zh_hant: 校驗

source: Refresh
zh_hans: 刷新
zh_hant: 重新整理

source: Connect
zh_hans: 连接
zh_hant: 連接

source: Activate
zh_hans: 激活
zh_hant: 激活

source: Disconnect
zh_hans: 断开
zh_hant: 斷開

source: Sample frame
zh_hans: 模拟帧
zh_hant: 模擬幀

source: Appearance
zh_hans: 外观
zh_hant: 外觀

# BackdropMaterial
source: Backdrop
zh_hans: 背景材质
zh_hant: 背景材質

source: Dark mode
zh_hans: 深色模式
zh_hant: 深色模式

source: Off
zh_hans: 关
zh_hant: 關

source: On
zh_hans: 开
zh_hant: 開

source: Language
zh_hans: 语言
zh_hant: 語言

source: Waiting
zh_hans: 等待
zh_hant: 等待

# WaitingData
source: Waiting for data
zh_hans: 等待数据
zh_hant: 等待資料

# Correct
source: OK
zh_hans: 正确
zh_hant: 正確

# Wrong
source: Error
zh_hans: 错误
zh_hant: 錯誤

source: Connected
zh_hans: 已连接
zh_hant: 已連接

source: Disconnected
zh_hans: 未连接
zh_hant: 未連接

# PinConnected
source: Closed
zh_hans: 通
zh_hant: 通

# PinDisconnected
source: Open
zh_hans: 断
zh_hant: 斷

# AppStarted
source: Local host started. Targets: VID_36B7 / VID_0716 PID_5060.
zh_hans: 本地上位机已启动，目标 VID_36B7 / VID_0716 PID_5060。
zh_hant: 本地上位機已啟動，目標 VID_36B7 / VID_0716 PID_5060。

# DisconnectedMessage
source: Disconnected.
zh_hans: 已断开连接。
zh_hant: 已斷開連接。

# ActivationSentTitle
source: Activation sent
zh_hans: 激活命令已发送
zh_hant: 激活命令已發送

# ActivationSentMessage
source: Device switched to continuous output mode.
zh_hans: 设备已切换到持续输出模式。
zh_hant: 設備已切換到持續輸出模式。

# ActivationFailedTitle
source: Activation failed
zh_hans: 激活失败
zh_hant: 激活失敗

# HoldOn
source: Hold enabled. Frame display is paused.
zh_hans: Hold 已开启，暂停刷新帧显示。
zh_hant: Hold 已開啟，暫停刷新幀顯示。

# HoldOff
source: Hold disabled. Live refresh resumed.
zh_hans: Hold 已关闭，恢复实时刷新。
zh_hant: Hold 已關閉，恢復即時刷新。

# SampleLoaded
source: Sample frame loaded.
zh_hans: 已载入模拟帧。
zh_hant: 已載入模擬幀。

# DeviceConnectedMessage
source: Connected {0}
zh_hans: 已连接 {0}
zh_hant: 已連接 {0}

# AutoConnectFailed
source: Auto-connect to {0} failed: {1}
zh_hans: 自动连接 {0} 失败：{1}
zh_hant: 自動連接 {0} 失敗：{1}

# AutoAttempt
source: Auto-preempt found {0}; connecting.
zh_hans: 自动抢占发现 {0}，准备连接。
zh_hant: 自動搶占發現 {0}，準備連接。

# NoDeviceTitle
source: No device found
zh_hans: 未发现设备
zh_hant: 未發現設備

# DevicesRefreshedTitle
source: Devices refreshed
zh_hans: 已刷新设备
zh_hant: 已重新整理設備

# InsertDeviceMessage
source: Insert an ATK-OA1 or WITRN K2.
zh_hans: 请插入 ATK-OA1 或 WITRN K2。
zh_hant: 請插入 ATK-OA1 或 WITRN K2。

# DeviceCountMessage
source: Found {0} target device(s).
zh_hans: 发现 {0} 个目标设备。
zh_hant: 發現 {0} 個目標設備。

# ReadInterruptedMessage
source: Device read was interrupted or the device was removed.
zh_hans: 设备读取中断或已拔出。
zh_hant: 設備讀取中斷或已拔出。

# DeviceConnectedTitle
source: Device connected
zh_hans: 设备已连接
zh_hant: 設備已連接

# DeviceDisconnectedTitle
source: Device disconnected
zh_hans: 设备未连接
zh_hant: 設備未連接

# PrimeActivationSent
source: Preempt activation sent. Waiting for the device to re-enumerate as a data interface.
zh_hans: 已发送抢占激活，等待设备重新枚举为数据接口。
zh_hant: 已發送搶占激活，等待設備重新枚舉為資料介面。

# OpenHidFailed
source: Unable to open HID device
zh_hans: 无法打开 HID 设备
zh_hant: 無法打開 HID 設備

# ConnectedLog
source: Connected {0} {1}
zh_hans: 已连接 {0} {1}
zh_hant: 已連接 {0} {1}

source: Connect pre-activation
zh_hans: 连接预激活
zh_hant: 連接預激活

# K2NoActivation
source: WITRN K2 does not require activation. Reading Metrics Report.
zh_hans: WITRN K2 无需激活，开始读取 Metrics Report。
zh_hant: WITRN K2 無需激活，開始讀取 Metrics Report。

# DeviceNotConnected
source: Device is not connected
zh_hans: 设备未连接
zh_hant: 設備未連接

# ActivationNotRequired
source: The current device does not require activation
zh_hans: 当前设备无需激活
zh_hant: 目前設備無需激活

# ReadInterruptedLog
source: Read interrupted: {0}
zh_hans: 读取中断：{0}
zh_hant: 讀取中斷：{0}

# FrameReceivedLog
source: Received frame #{0}: {1}
zh_hans: 收到数据帧 #{0}: {1}
zh_hant: 收到資料幀 #{0}: {1}

# ReportLengthLog
source: HID report length Input={0}, Output={1}, Feature={2}
zh_hans: HID 报告长度 Input={0}, Output={1}, Feature={2}
zh_hant: HID 報告長度 Input={0}, Output={1}, Feature={2}

# CapsFailedLog
source: HidP_GetCaps failed, status=0x{0:X8}
zh_hans: HidP_GetCaps 失败，status=0x{0:X8}
zh_hant: HidP_GetCaps 失敗，status=0x{0:X8}

source: exclusive read/write
zh_hans: 独占读写
zh_hant: 獨占讀寫

source: exclusive read
zh_hans: 独占只读
zh_hant: 獨占只讀

source: shared read/write
zh_hans: 共享读写
zh_hant: 共享讀寫

source: shared read
zh_hans: 共享只读
zh_hant: 共享只讀

# OpenHidFailedWithDetails
source: Unable to open HID device: {0}
zh_hans: 无法打开 HID 设备：{0}
zh_hant: 無法打開 HID 設備：{0}

# PrimeActivationWriteOnly
source: Preempt activation sent via {0} (write-only handle)
zh_hans: 已发送抢占激活 {0} (只写句柄)
zh_hant: 已發送搶占激活 {0} (只寫句柄)

# PrimeActivationFailed
source: Write-only preempt failed: {0}
zh_hans: 只写抢占失败：{0}
zh_hant: 只寫搶占失敗：{0}

# ActivationSendFailedKeep
source: Activation command failed; keeping connection and waiting for data: {0}
zh_hans: 激活命令发送失败，保持连接等待数据：{0}
zh_hant: 激活命令發送失敗，保持連接等待資料：{0}

# SourceSent
source: {0} sent via {1}
zh_hans: {0}已发送 {1}
zh_hant: {0}已發送 {1}

# SourceFailedKeep
source: {0} failed; keeping connection: {1}
zh_hans: {0}失败，继续保持连接：{1}
zh_hant: {0}失敗，繼續保持連接：{1}

# ActivationSentLog
source: Activation command sent via {0}
zh_hans: 已发送激活命令 {0}
zh_hant: 已發送激活命令 {0}

# ActivationSentHelper
source: Activation command sent via {0} (helper write handle)
zh_hans: 已发送激活命令 {0} (辅助写句柄)
zh_hant: 已發送激活命令 {0} (輔助寫句柄)

# HelperWriteHandle
source: helper write handle: {0}
zh_hans: 辅助写句柄: {0}
zh_hant: 輔助寫句柄: {0}

# ActivationSendFailed
source: Activation command failed: {0}
zh_hans: 激活命令发送失败：{0}
zh_hant: 激活命令發送失敗：{0}

source: Invalid handle
zh_hans: 句柄无效
zh_hant: 句柄無效

# IoTimeout
source: I/O operation timed out
zh_hans: I/O 操作超时
zh_hant: I/O 操作逾時

# K2EstimateNote
source: empirical estimate, not raw split values reported directly by K2 HID
zh_hans: 经验估算，非 K2 HID 直接上报的原始分离值
zh_hant: 經驗估算，非 K2 HID 直接上報的原始分離值

# K2EstimateLowConfidence
source: extrapolated; lower confidence
zh_hans: 外推，可信度下降
zh_hant: 外推，可信度下降
